In [17]:
import pandas as pd

In [18]:
df = pd.read_csv('penguins_size.csv')

In [19]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [20]:
df.rename(columns={'culmen_length_mm':'bill_length_mm', 'culmen_depth_mm':'bill_depth_mm'}, inplace=True)
df.shape

(344, 7)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                334 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [22]:
df.isnull().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [23]:
# return the rows with missing values
df[df.isnull().any(axis=1)]

# we can also fill the missing values with the mean and mode of the column

# df['bill_length_mm'].fillna(df['bill_length_mm'].mean(), inplace=True)
# df['bill_depth_mm'].fillna(df['bill_depth_mm'].mean(), inplace=True)
# df['flipper_length_mm'].fillna(df['flipper_length_mm'].mean(), inplace=True)
# df['body_mass_g'].fillna(df['body_mass_g'].mean(), inplace=True)
# df['sex'].fillna(df['sex'].mode()[0], inplace=True)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN
246,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN
286,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN
324,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [24]:
# drop the rows with missing values
df.dropna(inplace=True)

In [25]:
df.isnull().sum()

species              0
island               0
bill_length_mm       0
bill_depth_mm        0
flipper_length_mm    0
body_mass_g          0
sex                  0
dtype: int64

In [26]:
# removing the sex '.' rows
df = df[df['sex'] != '.']

In [27]:
df.shape

(333, 7)

In [28]:
print('species: ', df['species'].unique())
print('island: ', df['island'].unique())
print('sex: ', df['sex'].unique())

species:  ['Adelie' 'Chinstrap' 'Gentoo']
island:  ['Torgersen' 'Biscoe' 'Dream']
sex:  ['MALE' 'FEMALE']

In [29]:
# export the cleaned data
df.to_csv('penguins_cleaned.csv', index=False)

---

In [36]:
import pandas as pd

In [37]:
df = pd.read_csv('penguins_cleaned.csv')
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
4,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE

In [38]:
df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      333.000000     333.000000         333.000000   333.000000
mean        43.992793      17.164865         200.966967  4207.057057
std          5.468668       1.969235          14.015765   805.215802
min         32.100000      13.100000         172.000000  2700.000000
25%         39.500000      15.600000         190.000000  3550.000000
50%         44.500000      17.300000         197.000000  4050.000000
75%         48.600000      18.700000         213.000000  4775.000000
max         59.600000      21.500000         231.000000  6300.000000

In [39]:
# df[:1].to_csv('example_penguins_input.csv', index=False)